Clash Bot Workflow - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Workflow Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
module.create_team_step_function.data.aws_caller_identity.current: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_region.current[0]: Reading...
data.aws_iam_policy_document.event_handler_policy_document: Reading...
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=w6261upn4d]
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_lambda_event_publisher_exec_role]
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role]
data.aws_iam_policy_document.event_publisher_policy_document: Reading...
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group]
data.aws_iam_policy_document.event_handler_policy_document: Read complete after 0s [id=927500948]
data.aws_iam_policy_document.event_publisher_policy_document: Read complete after 0s [id=927500948]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
aws_iam_policy.event_publisher_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy]
aws_iam_policy.event_handler_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=retrieve-teams-development]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role-20231113053238999600000002]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_lambda_event_publisher_exec_role-20231113224304286700000001]
aws_lambda_function.event_publisher_lambda: Refreshing state... [id=clash-bot-event-publisher]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_gateway.aws_apigatewayv2_integration.this["$default"]: Refreshing state... [id=5tztbve]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
data.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
module.api_gateway.aws_apigatewayv2_route.this["$default"]: Refreshing state... [id=ycntu3f]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=cupiqn]
aws_lambda_function.event_handler_lambda: Refreshing state... [id=clash-bot-event-handler]
aws_lambda_event_source_mapping.sqs_trigger: Refreshing state... [id=bf5ea823-a758-4eb0-88b5-bae1b4ed37b9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_function.event_handler_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_handler_lambda" {
        id                             = "clash-bot-event-handler"
      ~ last_modified                  = "2023-11-13T23:43:11.000+0000" -> (known after apply)
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      ~ s3_key                         = "artifacts/development/16/event-handler-16.zip" -> "event-handler-101.tar.gz"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.event_publisher_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_publisher_lambda" {
        id                             = "clash-bot-event-publisher"
      ~ last_modified                  = "2023-11-13T23:43:10.000+0000" -> (known after apply)
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      ~ s3_key                         = "artifacts/development/16/event-publisher-16.zip" -> "event-publisher-101.tar.gz"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be destroyed
  # (because key ["$default"] is not in for_each map)
  - resource "aws_apigatewayv2_integration" "this" {
      - api_id                 = "w6261upn4d" -> null
      - connection_type        = "INTERNET" -> null
      - id                     = "5tztbve" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher" -> null
      - payload_format_version = "1.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = "w6261upn4d"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["$default"] will be destroyed
  # (because key ["$default"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "this" {
      - api_id               = "w6261upn4d" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "ycntu3f" -> null
      - request_models       = {} -> null
      - route_key            = "$default" -> null
      - target               = "integrations/5tztbve" -> null
    }

  # module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = "w6261upn4d"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /api/v2"
      + target             = (known after apply)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*